<html>
<link rel="stylesheet" href="https://hh-erja.github.io/erja.github.io/css/hhsty.css"
  type="text/css">
<head>
  <title>Kandidatuppsats i Digital Forensik</title>
</head>
<body bgcolor="#ffffff">

<div id="teach49"
style="position:absolute;left:20px;top:15px;z-order:2;decoration:none;visibility:visible">
<font class="g1">Uppslag till exjobb</font><br>
<font class="gggg2"><!--a href="http://www.hh.se/sitevision/proxy/arstudent/sokkursplan/sokkursplan.65444715.html/svid12_52ac50d015369393884e50ef/752680950/se_proxy/utb_kursplan.asp?kurskod=DT6004&revisionsnr=4&format=pdf">Kursplan</a><br--><br>
N&aring;gra uppslag till kandidatuppsater &auml;r f&ouml;ljande:
<ul>
  <li><strong>Ett nytt public-key-krypto</strong><br>
  Fundera &ouml;ver hur man skulle kunna anv&auml;nda n&aring;gon enkel matematisk fiffighet f&ouml;r att kryptera med publika nycklar och dekryptera med privata nycklar (se vidare nedan).</li><br>
  <li><strong>Kvantdatorprogrammering</strong><br>
  IBM har en publikt tillg&auml;nglig kvantdator som man kan skriva program f&ouml;r och k&ouml;ra online. Om man har ett problem som snabbare (i n&aring;got avseende) kan l&ouml;sas mha en kvantdator &auml;r detta intressant.</li><br>
  <li><strong>Ny hashfunktion</strong><br>
  Implementera den optimalt och benchmarka den mot befintliga metoder</li><br>
  <li><strong>Ny slumptalsgenerator</strong><br>
  PRNGs kan ha egenskaper som &auml;r olika bra f&ouml;r olika &auml;ndam&aring;l. En PRNG som &auml; bra ur s&auml;erhetssynpunkt &auml;r inte n&ouml;dv&auml;ndigtvis densamma som en som &auml;r bra f&ouml;r att simulera fram forskningresultat av h&ouml;g kvalitet. Om du har en egen algoritm som ger bra kvalitet kan denna benchmarkas mot befintliga.</li><br>
  <li><strong>Steganalys</strong><br>
  Hur kan man avsl&ouml;ja f&ouml;rs&ouml;k till steganografi? Inte mycket finns gjort f&ouml;r systematisk behandling p&aring; det omr&aring;det vilket betyder utrymme f&ouml;r egna bidrag.</li><br>
  <li><strong>Musiksteganografi</strong><br>
  Id&eacute;er till hur man kan g&ouml;mma meddelanden i musik finns det m&aring;nga men de brukar bygga p&aring; syntetisk generering och l&auml;mnar i regel tydliga sp&aring;r. Men eventuellt skulle man kunna g&ouml;ra p&aring; ett helt nytt s&auml;tt som bygger p&aring; att musiken verkligen spelas p&aring; riktigt och som garanterat inte l&auml;mnar artificiella sp&aring;r.</li><br>
  <li><strong>Hur kn&auml;cker man kryptochattar?</strong><br>
  Ber&auml;tta historien om den moderna kryptoanalys som blivit ett trumfkort mot den organiserade brottsligheten.</li><br>
  <li><strong>AI against counterfeiting</strong> (se vidare Charette [1])<br>
  Find out what benefits AI can bring to our modern anti-counterfeit system.<br>
  <i>DH Anticounterfeit</i></li><br>
  <li><strong>BI tools against counterfeiting</strong> (se vidare Charette [1])<br>
  Evaluate which Business Intelligence tool would be the perfect fit for integrating into our system.<br>
  <i>DH Anticounterfeit</i></li><br>
  <li><strong>Mobile apps against counterfeiting</strong> (se vidare Charette [1])<br>
  Help us to successfully take our field investigation mobile app to the market.<br>
  <i>DH Anticounterfeit</i></li><br>
  <li><strong>Security for anticounterfeiting</strong> (se vidare Charette [1])<br>
  Evaluate the security of our system using the latest hacking tools and your imagination.<br>
  <i>DH Anticounterfeit</i></li><br>
  <li><strong>Finansiell s&auml;kerhet</strong><br>
  <i>Resursbank</i></li><br>
  <li><strong>Third party rest API</strong><br>
  Build our developer friendly API for 3rd party integrators using the latest REST technology and using the OpenAPI standard.</li><br>
  <li><strong>Kryptografi</strong><br>
    F&ouml;rklaring och exempel p&aring; n&aring;gra krypteringssystem, vanliga attacker mot dessa och m&aring;tt p&aring; krypteringssystems styrka. Utveckling av f&ouml;rslag till egna krypteringssystem:
    <ul>
      <li><i>Symmetriskt</i><br>
      <table border="1"><tr><td>Vign&egrave;rekrypto med assymetrier enligt Diffie-Hellmans nyckelprotokoll</td></tr></table> eller <table border="1"><tr><td>XOR med n&aring;gon fiffig l&ouml;sning f&ouml;r nyckelhemligheten</td></tr></table> eller <table border="1"><tr><td>N&aring;got kvants&auml;kert symmetriskt krypto kombinerat med &ouml;verkryptering som l&ouml;sning p&aring; nyckelproblematiken</td></tr></table> eller <table border="1"><tr><td>Kryptering och dekryptering med transpositionskrypton</td></tr></table> &auml;r n&aring;gra f&ouml;rslag.</li>
      <li><i>Publika nycklar</i><br>
    Antingen <table border="1"><tr><td>RSA med modifierad faktoriserng av publik nyckel</td></tr></table> eller <table border="1"><tr><td>Elliptisk kurvkryptering baserad p&aring; Weierstrassformen <i>y<sup>2</sup>+ay=x<sup>3</sup>+bx<sup>2</sup>+cx+d</i> eller elliptisk kurvkryptering med annan grupparitmetik s&aring;som f&ouml;reslagen av Holmqvist [2].</td></tr></table> eller <table border="1"><tr><td>Matrisernas logaritmfunktion - ett env&auml;gsproblem perfekt f&ouml;r public-key-krypto?</td></tr></table> eller <table border="1"><tr><td>System som utnyttjar t.ex. Goldbachs hypotes eller tr&ouml;gheten i algoritmer f&ouml;r ber&auml;kning av gcd.</td></tr></table>
    (Goldbachs hypotes: Varje j&auml;mnt tal &ge;4 kan skrivas som summan av tv&aring; primtal. En variant p&aring; temat &auml;r att varje udda tal &ge;7 kan skrivas som summan av tre primtal. Lustigt nog har man lyckats bevisa det senare medan det f&ouml;rra p&aring;st&aring;endet f&ouml;rblivit en obevisad hypotes.)</li>
    </ul>
  </li><br>
  <li><strong>Analys av Voynichkoden -- v&auml;rldens k&auml;ndaste okn&auml;ckta krypto</strong><br>
    Vad kan vara anledningen till de fynd man kan g&ouml;ra om denna text? Hur kan man vidare unders&ouml;ka den? Dessutom kan arbetet handla om kryptoanalys av historiska krypton i allm&auml;nhet och en genomg&aring;ng av okn&auml;ckta krypton. I samarbete med en historiker eller arkeolog kan uppgiften att kn&auml;cka oforcerade krypton anammas med f&ouml;rb&auml;ttrade f&ouml;ruts&auml;ttningar. Tidigare v&auml;lk&auml;nda krypton kan n&auml;mnas. Andra aspekter p&aring; krypton &auml;n forcering (s&aring;som komplexitet, indikatorer p&aring; multipla upphovsm&auml;n etc.) kan ocks&aring; bearbetas.</li><br>
  <li><strong>En ing&aring;ende studie av side-channel-attacker</strong><br>
   Vid HH har vi unika f&ouml;ruts&auml;ttningar f&ouml;r ett s&aring;dant projekt, s&aring;v&auml;l betr&auml;ffande materiella som kompetensm&auml;ssiga resurser.</li><br>
  <!-- li><strong></strong><br>
   </li -->
  <li><strong>Industrispionage via hemliga kretsar i h&aring;rdvara</strong><br>
    M&aring;nga v&auml;stl&auml;nder har f&ouml;rbjudit HUAWEI och andra kinesiska telekombolag att verka i landet d&aring; man anser att bevis finns f&ouml;r att bolagen bedriver industrispionage (Sveriges Radio [3]). Hur g&aring;r detta till exakt? Vad kan bli framtidsutsikterna? Kan man med hj&auml;lp av mjukvara detektera och hindra s&aring;dan avlyssning?</li><br>
  <li><strong>Blockkedjeteknik f&ouml;r konfidentiellt material</strong><br>
    T.ex. f&ouml;r hantering av f&ouml;runders&ouml;kningsmaterial eller underr&auml;ttelseinformation och vid medicinska studier finns behovet att dela stora material inom grupper av beh&ouml;riga personer. Ibland kan olika personer vara beh&ouml;riga till olika delar av materialet. F&ouml;r s&aring;dana behov kan den relativt nya tekniken med blockkedjor ge &ouml;kad s&auml;kerhet och/eller m&ouml;jligheter. Blockkedjetekniken finns idag i en uppsj&ouml; av olika varianter f&ouml;r att passa olika syften -- se g&auml;rna det utm&auml;rkta f&ouml;redraget <a href="https://www.youtube.com/watch?v=5HI-M7Uikfg">Smart digital contracts for distributed ledger technology</a> av Fritz Henglein fr&aring;n Halmstad Colloquium.</li><br>
  <li><strong>Kartl&auml;ggning av f&ouml;rekomst av steganografi</strong><br>
    Idag finns metoder f&ouml;r b&aring;de steganografi och steganalys, men det &auml;r f&aring; studier som klarg&ouml;r att detta verkligen &auml;r ett befintligt problem.</li><br>
  <li><strong>Uppvigling och opinionsbildning via sociala medier</strong></li><br>
  <li><strong>Detektering av terrorism och/eller organiserad brottslighet mha artificiell intelligens</strong></li><br>
  <li><strong>Protokoll f&ouml;r administrering av krypteringsnycklar</strong></li><br>
  <li><strong>Protokoll f&ouml;r digital signering och/eller autenticering</strong></li><br>
  <li><strong>Hashfunktioner baserade p&aring; elliptiska kurvor</strong></li><br>
  <li><strong>Kryptoanalys av RSA-systemet</strong><br>
    Genomg&aring;ng och evaluering av befintliga attacker samt eventuellt utveckling av nya.</li><br>
  <li><strong>En attack mot ett kvantdators&auml;kert nyckeletableringsprotokoll</strong><br>
    I J&auml;rpe [4] presenteras ett protokoll f&ouml;r generering av en delad hemlighet. Protokollet liknar mycket det v&auml;lk&auml;nda Diffie-Hellman-protokollet. Till skillnad fr&aring;n detta &auml;r det som presenteras dock s&auml;kert mot attacker m.h.a. kvantdatorer. Man skulle emellertid kunna ange en annan attack mot protokollet som inte ens beh&ouml;ver en kvantdator f&ouml;r att genomf&ouml;ras.</li><br>
  <li><strong>Attack mot kvantdators&auml;kra krypteringssystem</strong><br>
    Implementering av <a href="https://en.wikipedia.org/wiki/Grover%27s_algorithm">Grovers aloritm</a> f&ouml;r kryptoanalys av postkvantumkrypton.</li><br>
  <li><strong>S&auml;kring av informationsfl&ouml;den vid anv&auml;ndning av IOT-produkter</strong></li><br>
  <li><strong>Molnet - en s&auml;kerhetsrisk?</strong><br>
    M&aring;nga &auml;r vi som laddar upp bilder p&aring; semestern till googledrive och n&auml;stan alla anv&auml;nder molnlagring p&aring; ett eller annat s&auml;tt. Men hur s&auml;kra kan vi vara p&aring; att informationen aldrig kommer anv&auml;ndas av n&aring;gon annan?</li><br>
  <li><strong>Privacy, hur kan konfidensialitet garanteras?</strong><br>
    Vid rapportering av konfidentiella data som sammanst&auml;lls on-line till statistik finns risken f&ouml;r l&auml;ckage. Vad finns det f&ouml;r skydd mot detta och vilka alternativ skulle man kunna t&auml;nka sig?</li><br>
  <li><strong>On-line-ber&auml;knare av...</strong>
      <ul>
          <li><i>Multiplikation och addition med mycket stora tal</i><br>
      Att g&ouml;ra element&auml;ra heltalsber&auml;kningar d&aring; talen har flera hundra eller t.o.m. tusentals siffror blir ett ohanterligt problem i de flesta expertsystem och programmeringsspr&aring;k. Det kan dock mycket enkelt l&ouml;sas med n&aring;gra rader programmeringskod...</li>
          <li><i>Diskret logaritm</i><br>
      Det finns f&ouml;rvisso n&aring;gra varianter redan (<a href="https://www.alpertron.com.ar/DILOG.HTM">Alpertrons Discrete Logarithm calculator</a>, MultiplicativeOrder[a,n,b] p&aring; <a href="http://www.wolframalpha.com">Mathematicas &ouml;ppna sida</a>, <a href="https://www.di-mgt.com.au/bdcalc.html">bdcalc</a> - egentligen en samling skriptprogram, bl.a. skriptet discretelog.gdscr som ska kunna ber&auml;kna diskreta logaritmen i.o.f.s. inte on-line men &auml;nd&aring;) l&auml;mpliga f&ouml;r krypterings&auml;ndam&aring;l - som uppges ha st&ouml;d f&ouml;r godtyckligt stora tal. Kan du/ni g&ouml;ra en mer pedagogiskt upplagd, kanske snabbare? Mer on-line? Genom att anv&auml;nda brute force, Pohlig-Hellman, Pollards rho eller en annan algoritm? Och hur f&ouml;rh&aring;ller sig dessa algoritmer till varandra ur ett ber&auml;kningstekniskt perspektiv?</li>
          <li><i>Diskret exponentiering</i><br>
      Hur kan man effektivast ber&auml;kna potenser d&aring; b&aring;de bas, exponent och gruppens ordning &auml;r stora tal?</li>
      </ul>
      </li><br>
  <li><strong>Generalisering av Pholig-Hellman</strong><br>
      Pholig-Hellmans metod f&ouml;r ber&auml;kning av diskret logaritm g&auml;ller bara f&ouml;r f&auml;lt av primtalskarakteristik. Kan man generalisera resultatet och metoden f&ouml;r f&auml;lt av allm&auml;n karakteristik? S&aring; klart man kan!</li><br>
  <li><strong>Kvantdatorprogrammering</strong><br>
      Hur skulle man kunna skriva ett program f&ouml;r ber&auml;kning av gcd, primtalsbest&auml;mning, simulering av slumptal och stokastiska processer? Kvantdatorernas entr&eacute; rycker allt n&auml;rmare och s&aring; fort de utg&ouml;r ett reellt alternativ till en vanlig dator kommer allt vad ber&auml;kningskomplexitet betr&auml;ffar st&auml;llas p&aring; &auml;nda.</li><br>
  <li><strong>Exjobb p&aring; Polisen eller NFC</strong><br>
  L&auml;s mer <a href="https://polisen.se/jobb-och-utbildning/jobba-hos-polisen/var-verksamhet/jobb-it-avdelningen/student-och-nyexaminerad-inom-it/examensarbete/">h&auml;r</a> om vilka uppslag till uppsatsprojekt som de erbjuder och <a href="https://polisen.se/jobb-och-utbildning/jobba-hos-polisen/var-verksamhet/it-forensik/">h&auml;r</a> om att jobba d&auml;r. Klicka <a href="https://polisen.se/om-polisen/kontakt/nfc/">h&auml;r</a> om du vill kontakta NFC.</li><br>
  <li><strong>Exjobb p&aring; S&Auml;PO</strong><br>
  L&auml;s <a href="https://sakerhetspolisen.se/jobba-hos-oss/jobba-med-it-och-teknik.html">h&auml;r</a> och <a href="https://sakerhetspolisen.se/jobba-hos-oss/medarbetarportratt/karl-och-bjorn-sakrar-bevis-i-it-miljo.html">h&auml;r</a> om att jobba med IT och forensik vid s&auml;kerhetspolisen. Ha &auml;ven koll p&aring; deras <a href="https://sakerhetspolisen.se/ovriga-sidor/nyheter.html">nyhetssida</a> f&ouml;r eventuella anlag om capture-the-flag-t&auml;vlingar och annat sp&auml;nnande.</li><br>
  <li><strong>Exjobb p&aring; FRA</strong><br>
  L&auml;s mer p&aring; deras sida om <a href="https://fra.se/2.55af049f184e92956c429d8.html">aktuella h&auml;ndelser, n&aring;gra anst&auml;llda och deras arbete, lediga jobb p&aring; FRA, </a> eller <a href="https://www.fra.se/kontakt.4.366a07df16362a003fc9999.html">kontakta dem</a> och efterfr&aring;ga om de erbjuder n&aring;got uppsatsprojekt.</li><br>
  <li><strong>Exjobb p&aring; FOI</strong><br>
  L&auml;s mer <a href="https://www.foi.se/jobba-hos-oss/student-som-gillar-utmaningar-exjobba-hos-oss.html">h&auml;r</a> om vilka uppslag till uppsatsprojekt som de erbjuder.</li><br>
</ul>

[1] Charette, Robert N., <a href="https://spectrum.ieee.org/computing/it/inside-hidden-world-legacy-it-systems">The hidden world of legacy IT</a>, IEEE Spectrum 9-20, 2020.<br>
[2] Holmqvist, Ing-Marie, <a href="http://ltu.diva-portal.org/smash/record.jsf?faces-redirect=true&aq2=%5B%5B%5D%5D&af=%5B%5D&searchType=SIMPLE&query=&language=sv&pid=diva2%3A1026512&aq=%5B%5B%5D%5D&sf=all&aqe=%5B%5D&sortOrder=author_sort_asc&onlyFullText=false&noOfRows=50&dswid=-9184"</a>Elliptiska kurvor</a>, examensarbete i Matematik p&aring; magisterniv&aring;, Lule&aring; Tekninska Universitet<br>
[3] P1 Morgon, reportage i Sveriges Radio den 2018-01-17. <a href="sr2019-01-17_Studio_1_Anklagelser_om_kinesiskt_industrispionage.mp3">Lyssna h&auml;r!</a><br>
[4] J&auml;rpe, Eric, <a href="https://www.mdpi.com/2410-387X/4/1/5/htm">An alternative Diffie-Hellman protocol</a>, Cryptography, vol. 4, nr 1, 2020<br>
&nbsp;<br>
</div>
</html>
